/*
 * @Description: 
 * @Author: xfGuo
 * @Date: 2020-10-12 11:03:32
 * @LastEditors: xfGuo
 * @LastEditTime: 2020-10-12 11:03:36
 */
// error.js文件
export default {
　40101: '再输错两次将锁住',
　40200: '用户不存在',
　　200: '服务器成功返回请求的数据。',
　　201: '新建或修改数据成功。',
　　202: '一个请求已经进入后台排队（异步任务）。',
　　204: '删除数据成功。',
　　400: '发出的请求有错误，服务器没有进行新建或修改数据的操作。',
　　401: '用户权限错误。',
　　403: '权限信息错误。',
　　404: '发出的请求针对的是不存在的记录，服务器没有进行操作。',
　　406: '请求的格式不可得。',
　　410: '请求的资源被永久删除，且不会再得到的。',
　　422: '当创建一个对象时，发生一个验证错误。',
　　500: '服务器发生错误，请检查服务器。',
　　502: '网关错误。',
　　503: '服务不可用，服务器暂时过载或维保。',
　　504: '网关超时。',
}